# IFC_DMSetFieldMap

```pascal
FUNCTION IFC_DMSetFieldMap(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING;
				strMappingSrc  : STRING): BOOLEAN;
```

```python
def vs.IFC_DMSetFieldMap(inStrObjName, inStrEntryName, inStrFieldName, strMappingSrc):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING|   |
|inStrEntryName|STRING|   |
|inStrFieldName|STRING|   |
|strMappingSrc|STRING|   |

## Version
Available from: Vectorworks 2017

## Category
* IFC